{
  "id": "0b8c53eb-442c-4738-addc-ce55739896f1",
  "siteName": "LetsGrowPro",
  "domainUrl": "letsgrowpro.com",
  "brandingPresets": [
    {
      "presetId": "9fcae758-95a7-4545-9fbd-b80749c06532",
      "brandIdentity": {
        "designSummary": "This design features a minimalistic and refined aesthetic with a spacious, balanced layout. The color palette is dominated by a soft, warm off-white background paired with black and dark gray text for high contrast and readability. Typography plays a central role, combining large, bold, geometric sans-serif headings with delicate italic serif body text to create a sophisticated editorial tone. The layout uses generous white space and a modular grid with consistent margins and subtle rounded corners on images and cards, adding a modern yet approachable softness. UI elements are understated with thin borders and minimal fills, emphasizing clarity and elegance. Overall, the design conveys a timeless, high-end brand identity suitable for luxury products, focusing on simplicity, clarity, and subtle sophistication.",
        "toneOfVoice": "Sophisticated, minimalistic, elegant, and modern with a calm and refined personality.",
        "tones": [
          "calm",
          "sophisticated",
          "minimal",
          "elegant",
          "modern",
          "refined",
          "timeless",
          "clean",
          "balanced",
          "understated"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Modern"
          ],
          "supportingStyles": [
            "Editorial",
            "Luxury"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#000000",
            "primaryForeground": "#F7F5F0",
            "secondary": "#4A4A4A",
            "secondaryForeground": "#F7F5F0",
            "background": "#F7F5F0",
            "customColors": [
              {
                "name": "subtleborder",
                "value": "#D1CDC7"
              },
              {
                "name": "mutedgray",
                "value": "#B0B0B0"
              },
              {
                "name": "foreground",
                "value": "#4A4A4A"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary canvas to create a soft, warm environment that supports content without distraction. The 'primary' color is reserved for main text and headings to ensure maximum readability and strong visual hierarchy. The 'secondary' color is used for less prominent text and UI elements, providing subtle contrast without overpowering the primary text. The 'subtleBorder' color is ideal for delicate dividing lines and borders around interactive elements, maintaining the minimal aesthetic. The 'mutedGray' color can be used for secondary UI elements or placeholder text to add depth without breaking the calm tone. All colors should be combined to maintain high contrast and accessibility, with 'primary' text on 'background' for main content and 'secondary' for supporting text. Avoid using heavy fills or saturated colors to preserve the understated luxury feel.",
          "paletteAccessibilityNotes": "The 'primary' color on 'background' provides excellent contrast exceeding WCAG AA standards for all text sizes. The 'secondary' color on 'background' also meets WCAG AA contrast requirements for body text and UI elements. Borders and subtle UI accents using 'subtleBorder' and 'mutedGray' maintain sufficient contrast for visibility without overwhelming the design. Overall, the palette supports accessible reading and interaction while preserving the minimal and elegant aesthetic."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "avenir-lt-w01_85-heavy1475544",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "futura-lt-w01-book",
              "montserrat",
              "oswald"
            ],
            "headingsUsageGuide": "Use the heading font in large sizes with tight letter spacing to create strong visual impact and hierarchy. Headings should be uppercase or all caps for a clean, modern look. Pair headings with the serif paragraph font to create contrast and balance. Maintain generous spacing around headings to preserve the minimal aesthetic. Use the 'primary' color for headings to ensure maximum readability and emphasis.",
            "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' provide excellent contrast and meet WCAG AA standards for all sizes, ensuring clear readability and accessibility."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "baskervillemtw01-smbdit",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "playfair display",
              "didot-w01-italic",
              "cormorantgaramond-light"
            ],
            "paragraphsUsageGuide": "Use the paragraph font in smaller sizes with italic styling to add a refined, editorial tone. This font contrasts with the bold sans-serif headings, creating a balanced typographic hierarchy. Use the 'secondary' color for body text and captions to soften the visual weight while maintaining readability. Maintain ample line height and spacing to enhance legibility and preserve the airy feel of the layout.",
            "paragraphsAccessibilityNotes": "Paragraph text in 'secondary' color on 'background' meets WCAG AA contrast requirements for body text, ensuring accessible reading while supporting the elegant design."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a two-column layout with large, bold headings occupying the left quadrant and a product image with rounded corners on the right quadrant. This placement balances visual weight between text and imagery, creating a harmonious and inviting introduction. The heading's large size and tight letter spacing draw immediate attention, while the image's soft edges and neutral background complement the typography. The generous white space around both elements enhances clarity and focus, reinforcing the minimal and elegant brand identity."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.01em",
              "fontWeight": "600"
            },
            {
              "name": "xl",
              "size": "1.5rem",
              "lineHeight": "1.4",
              "letterSpacing": "0em",
              "fontWeight": "700"
            },
            {
              "name": "2xl",
              "size": "2rem",
              "lineHeight": "1.3",
              "letterSpacing": "-0.01em",
              "fontWeight": "700"
            },
            {
              "name": "3xl",
              "size": "2.5rem",
              "lineHeight": "1.2",
              "letterSpacing": "-0.02em",
              "fontWeight": "800"
            },
            {
              "name": "4xl",
              "size": "3rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.03em",
              "fontWeight": "800"
            },
            {
              "name": "5xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "-0.04em",
              "fontWeight": "900"
            },
            {
              "name": "6xl",
              "size": "4.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.05em",
              "fontWeight": "900"
            },
            {
              "name": "7xl",
              "size": "5.5rem",
              "lineHeight": "1.05",
              "letterSpacing": "-0.06em",
              "fontWeight": "900"
            },
            {
              "name": "8xl",
              "size": "6.5rem",
              "lineHeight": "1",
              "letterSpacing": "-0.07em",
              "fontWeight": "900"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "-0.08em",
              "fontWeight": "900"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Spacious",
            "contrastSpectrum": "High-Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Modular",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use generous padding and subtle borders in 'subtleBorder' color to define sections without heavy visual weight. Rounded corners soften container edges, maintaining the minimal and approachable feel. Backgrounds remain in 'background' color to preserve consistency.",
          "images": "Product images are presented with muted, neutral backgrounds in 'mutedGray' or similar tones, with rounded corners to soften the geometric layout. Images are large and clear, emphasizing product form and material without distraction.",
          "buttons": "Buttons are minimal with thin borders in 'primary' color and transparent backgrounds. Text inside buttons uses 'primary' color for clarity. On hover, buttons may invert colors or slightly darken the border to indicate interactivity while maintaining subtlety."
        },
        "graphicElements": {
          "icons": "Icons are line-based, minimal, and use the 'primary' color to maintain consistency with text and UI elements. They are simple and unobtrusive, supporting navigation and interaction without drawing excessive attention.",
          "illustrations": "No illustrations are used, keeping the focus on product photography and typography to maintain a clean and sophisticated look.",
          "stickers": "Stickers or badges, such as sale indicators, use subtle outlines in 'primary' color with italic serif text to blend with the editorial tone without disrupting the minimal aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750580630382-Screenshot%202025-06-22%20at%2011.23.45.png"
      ]
    },
    {
      "presetId": "a2e0d88a-61ed-4879-a4ce-de21b27b7bc3",
      "brandIdentity": {
        "designSummary": "The design features a warm, earthy color palette with soft cream, pale greenish-beige, and deep brown tones that create a natural and elegant atmosphere. Typography plays a central role, with large, classic serif fonts for headings that convey craftsmanship and luxury, paired with clean serif body text for readability. The layout is spacious and balanced, using generous white space and a column-based grid with subtle asymmetry to maintain visual interest. UI components like buttons and containers are minimal and understated, emphasizing simplicity and elegance. The overall aesthetic is timeless and artisanal, suitable for brands that value natural materials and refined presentation.",
        "toneOfVoice": "Sophisticated, warm, artisanal, and refined with a calm and inviting personality.",
        "tones": [
          "calm",
          "sophisticated",
          "warm",
          "natural",
          "elegant",
          "refined",
          "artisanal",
          "timeless",
          "inviting",
          "minimalist"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Luxury",
            "Artisanal"
          ],
          "supportingStyles": [
            "Editorial",
            "Natural",
            "Classic"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#5B3A29",
            "primaryForeground": "#F0EDE6",
            "secondary": "#D9E0B0",
            "secondaryForeground": "#5B3A29",
            "background": "#F0EDE6",
            "customColors": [
              {
                "name": "footerbackground",
                "value": "#2E1B17"
              },
              {
                "name": "linkcolor",
                "value": "#5B3A29"
              },
              {
                "name": "buttonborder",
                "value": "#5B3A29"
              },
              {
                "name": "foreground",
                "value": "#5B3A29"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'background' color as the primary page background to create a soft, warm canvas. The 'primary' color is ideal for headings, key text elements, and interactive text such as links and buttons, paired with 'primaryForeground' for contrast on dark backgrounds like the footer. The 'secondary' color serves well for section backgrounds or subtle highlights, with 'secondaryForeground' used for text on these backgrounds to maintain readability. The 'footerBackground' anchors the page footer with a deep, rich tone, contrasting with 'primaryForeground' text for accessibility. The 'linkColor' and 'buttonBorder' colors are used for interactive elements, ensuring they stand out while maintaining the natural, elegant aesthetic. This palette supports a calm, sophisticated atmosphere with strong accessibility and visual harmony.",
          "paletteAccessibilityNotes": "The 'primaryForeground' on 'primary' and 'footerBackground' colors meet WCAG AA contrast standards for large and normal text, ensuring readability. The 'secondaryForeground' on 'secondary' also meets contrast requirements for body text. Links and buttons using 'linkColor' and 'buttonBorder' on 'background' or 'secondary' backgrounds maintain sufficient contrast for accessibility compliance."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "bitter",
              "cormorantgaramond",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all primary headings to convey sophistication and craftsmanship. Headings should be large, spaced with generous line height to enhance readability and elegance. Pair with body text fonts that are clean and legible to maintain hierarchy and balance. Use the 'primary' color for headings on light backgrounds and 'primaryForeground' on dark backgrounds to ensure contrast and accessibility.",
            "headingsAccessibilityNotes": "Headings in 'primary' on 'background' and 'primaryForeground' on 'footerBackground' meet WCAG AA contrast standards for all sizes, ensuring clear readability."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "madefor-display",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "playfair display",
              "cormorantgaramond-light",
              "raleway"
            ],
            "paragraphsUsageGuide": "Use the 'bitter' font for body text to provide a clean, readable experience that complements the more decorative heading font. Maintain consistent line height and letter spacing for comfortable reading. Text color should be 'primary' on light backgrounds and 'primaryForeground' on dark backgrounds. Avoid overly small font sizes to preserve legibility, especially on mobile devices.",
            "paragraphsAccessibilityNotes": "Body text in 'primary' on 'background' and 'primaryForeground' on 'footerBackground' meets WCAG AA contrast requirements for normal and large text."
          },
          "welcomeSectionTypography": {
            "placement": "Triple Panel Editorial",
            "implementation": "The welcome fold is divided into three distinct vertical panels of differing widths. The far left narrow column features strong branding or logo, often with a bold color background. The central, wider panel presents a powerful visual, such as a photo or artwork, serving as the primary focus. The far right column contains key information, such as event details and a call-to-action button. This layout creates a sophisticated, editorial look and striking asymmetry, drawing the eye to the image first, then to key actions and branding."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "400"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.035em",
              "fontWeight": "600"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Subtle",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use subtle background color shifts between 'background' and 'secondary' to delineate sections softly without harsh borders, maintaining a clean and elegant flow. Padding is consistent to ensure content breathes and aligns with the overall spacious layout.",
          "images": "Images are presented with no borders or shadows, emphasizing natural textures and materials. They are integrated into the grid with balanced spacing, often paired side-by-side with text blocks to create harmony and visual interest.",
          "buttons": "Buttons are minimal with thin borders in 'buttonBorder' color and text in 'primary'. They have no heavy backgrounds, maintaining the understated elegance. On hover or focus, the button text or border may darken slightly to indicate interactivity while preserving subtlety."
        },
        "graphicElements": {
          "icons": "Icons are minimal or absent, focusing on typography and photography to convey the brand message. If used, icons would be line-based, simple, and in 'primary' color to maintain consistency.",
          "illustrations": "No illustrations are present; the design relies on photography and typography for visual storytelling.",
          "stickers": "No stickers or badges are used, preserving the clean and sophisticated aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752405607909-Group%201000002186.jpg"
      ]
    },
    {
      "presetId": "0079631d-84b2-4f48-9303-aab170f0220b",
      "brandIdentity": {
        "designSummary": "This design features a modern classic aesthetic with editorial influences, characterized by a clean, spacious layout and a warm, earthy color palette. The primary colors include a rich burnt orange and deep brown, paired with soft off-white backgrounds and subtle pastel accents. Typography is dominated by elegant serif fonts for headings and complementary serif or serif-inspired fonts for body text, creating a refined and readable hierarchy. The layout employs generous whitespace, modular grids, and balanced text-image relationships, fostering a calm and uncluttered user experience. UI components such as buttons and containers use solid, warm colors to highlight calls to action while maintaining a minimalist and sophisticated style. Overall, the design conveys quality, trust, and comfort, making it adaptable for various premium industries.",
        "toneOfVoice": "warm, trustworthy, sophisticated, and inviting with a professional yet approachable personality.",
        "tones": [
          "Warm",
          "Trustworthy",
          "Sophisticated",
          "Inviting",
          "Calm",
          "Elegant",
          "Professional",
          "Approachable",
          "Clean",
          "Spacious"
        ],
        "designStyle": {
          "primaryStyle": [
            "Modern Classic",
            "Editorial"
          ],
          "supportingStyles": [
            "Minimalism",
            "Warm Naturalism"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#B94A1F",
            "primaryForeground": "#FFFFFF",
            "secondary": "#4A2C23",
            "secondaryForeground": "#F9F5F0",
            "background": "#F9F5F0",
            "customColors": [
              {
                "name": "pastellavender",
                "value": "#D6D0DD"
              },
              {
                "name": "pastelbeige",
                "value": "#E6D6C4"
              },
              {
                "name": "pastelgreen",
                "value": "#DCE6CD"
              },
              {
                "name": "pastelpeach",
                "value": "#F7BFA6"
              },
              {
                "name": "foreground",
                "value": "#4A2C23"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for key interactive elements such as buttons, links, and highlights to draw user attention effectively. The 'primaryForeground' color ensures text and icons on 'primary' backgrounds remain highly legible. The 'secondary' color is ideal for headings, subheadings, and important text elements, paired with 'secondaryForeground' for contrast and readability. The 'background' color provides a soft, neutral canvas that supports content without distraction. The custom colors 'pastelLavender', 'pastelBeige', 'pastelGreen', and 'pastelPeach' serve as subtle accent blocks or backgrounds for data visualization and highlight sections, adding warmth and variety while maintaining harmony with the core palette. These colors should be used sparingly to maintain a clean and sophisticated look. Overall, the palette balances warmth and professionalism, ensuring accessibility and visual comfort across the site.",
          "paletteAccessibilityNotes": "The 'primary' color on 'primaryForeground' (white) meets WCAG AA and AAA contrast standards for text and UI elements, ensuring readability. The 'secondary' color on 'secondaryForeground' also meets WCAG AA contrast ratios for headings and important text. The 'background' color provides sufficient contrast with both 'primary' and 'secondary' text colors for body content. Custom pastel colors have moderate contrast and are best used for large text or non-critical UI elements to maintain accessibility. Overall, the palette supports strong visual hierarchy and accessibility compliance."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "bitter",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "cormorantgaramond",
              "didot-w01-italic"
            ],
            "headingsUsageGuide": "Use the 'bitter' font for all primary headings to convey elegance and professionalism. Headings should be large with generous line height and spacing to enhance readability and create a strong visual hierarchy. Pair headings with body text fonts that complement serif styles for balance. Use the 'secondary' color for headings to maintain contrast and brand consistency. Avoid overcrowding headings with excessive weight or size to preserve the clean aesthetic.",
            "headingsAccessibilityNotes": "Headings in 'bitter' paired with the 'secondary' color on the 'background' color meet WCAG AA contrast standards, ensuring clear readability for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "raleway",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "noto",
              "open sans",
              "nunito sans"
            ],
            "paragraphsUsageGuide": "Use the 'raleway' font for body text to maintain typographic harmony with headings. Body text should be set at a comfortable size with moderate line height for easy reading. Use the 'secondary' color for body text on the 'background' color to ensure sufficient contrast. Maintain consistent spacing between paragraphs and sections to support a clean, uncluttered layout. Avoid overly dense text blocks to preserve the spacious feel of the design.",
            "paragraphsAccessibilityNotes": "Body text in 'raleway' with the 'secondary' color on the 'background' color meets WCAG AA contrast requirements, supporting accessibility for all users."
          },
          "welcomeSectionTypography": {
            "placement": "Top-Third Anchor",
            "implementation": "The welcome section typography is anchored in the top third of the hero image area, with large, elegant headings placed on a semi-opaque background block. This placement ensures immediate visual impact and readability against the photographic backdrop. The heading uses a large serif font with ample spacing, while the supporting text is smaller and more subdued, creating a clear hierarchy. The call-to-action button is positioned below the text block, using the 'primary' color to stand out. This approach balances visual prominence with clarity, guiding the user's focus naturally from headline to action."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.045em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Modular",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers use soft background colors or subtle pastel blocks to separate content sections, maintaining a clean and elegant look. Borders are minimal or absent, relying on spacing and color contrast for separation. The 'background' color predominates, with custom pastel colors used sparingly for emphasis.",
          "images": "Images are large, high-quality, and naturalistic, often spanning full width or large columns. They are framed by generous whitespace and rarely overlapped by text except in hero sections with semi-opaque overlays. The style is warm and inviting, supporting the brand's premium feel.",
          "buttons": "Buttons are solid blocks of the 'primary' color with 'primaryForeground' text, featuring clean edges and moderate padding. Secondary buttons use a subtle background or border with the 'primary' color for text or outlines. Buttons have clear hover states and are sized for easy interaction."
        },
        "graphicElements": {
          "icons": "Icons are minimal, line-based, and use the 'secondary' color to maintain subtlety and elegance. They support navigation and UI without drawing excessive attention.",
          "illustrations": "No prominent illustrations are used, maintaining a photographic and realistic visual style.",
          "stickers": "No stickers or badges are present, preserving the clean and professional aesthetic."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750574994718-Screenshot%202025-06-22%20at%209.49.48.png"
      ]
    },
    {
      "presetId": "f1e79196-99b9-438b-ab1c-97f405071aa3",
      "brandIdentity": {
        "designSummary": "This design features a harmonious blend of natural, earthy tones with a restrained and elegant color palette centered on deep forest green, soft beige, and muted yellow accents. The layout is grid-based and balanced, with generous spacing and rounded corners that soften the overall aesthetic. Typography is serif-based, combining elegance with approachability, supporting a wholesome and artisanal brand identity. Buttons and interactive elements use the yellow accent to draw attention subtly, while the dark green provides strong contrast for text and backgrounds. The overall visual style is clean, modern, and nature-inspired, evoking sustainability, calmness, and trustworthiness, suitable for brands emphasizing natural and plant-based products.",
        "toneOfVoice": "Natural, authentic, approachable, and trustworthy with a calm and artisanal personality.",
        "tones": [
          "calm",
          "natural",
          "trustworthy",
          "artisanal",
          "approachable",
          "sustainable",
          "elegant",
          "organic",
          "warm",
          "balanced",
          "clean",
          "authentic",
          "friendly",
          "grounded",
          "refined"
        ],
        "designStyle": {
          "primaryStyle": [
            "Minimalism",
            "Organic",
            "Modern"
          ],
          "supportingStyles": [
            "Artisanal",
            "Natural",
            "Soft Rounded"
          ]
        },
        "palette": {
          "colors": {
            "primary": "#2B3A2E",
            "primaryForeground": "#D9D6C3",
            "secondary": "#D9D6C3",
            "secondaryForeground": "#2B3A2E",
            "background": "#D9D6C3",
            "customColors": [
              {
                "name": "accentyellow",
                "value": "#E6E27A"
              },
              {
                "name": "darkbackground",
                "value": "#2B3A2E"
              },
              {
                "name": "lightbackground",
                "value": "#D9D6C3"
              },
              {
                "name": "foreground",
                "value": "#2B3A2E"
              }
            ]
          },
          "paletteUsageGuide": "Use the 'primary' color for main text, headers, and key UI elements to establish a strong natural presence. The 'secondary' color serves as the base background, providing a soft, warm canvas that supports readability and calmness. The 'primaryForeground' color is used for text on 'primary' backgrounds to ensure legibility. The 'secondaryForeground' is used for text on 'secondary' backgrounds, maintaining contrast and clarity. The 'accentYellow' color is reserved for call-to-action buttons, highlights, and interactive elements to attract attention without disrupting the calm tone. The 'darkBackground' can be used for testimonial sections or footers to create visual separation, with 'lightBackground' text for contrast. Colors should be combined thoughtfully to maintain accessibility and a cohesive natural aesthetic.",
          "paletteAccessibilityNotes": "The 'primary' color (#2B3A2E) on 'secondary' (#D9D6C3) background achieves WCAG AA contrast for body text and headings. The 'accentYellow' (#E6E27A) on 'primary' (#2B3A2E) background meets WCAG AA contrast for buttons and call-to-actions. Text in 'primaryForeground' (#D9D6C3) on 'primary' (#2B3A2E) background also meets WCAG AA standards. The palette ensures sufficient contrast for readability across all text and background combinations used in the design."
        },
        "typography": {
          "headings": {
            "font": {
              "role": "Primary Heading Font",
              "fontFamily": "cormorantgaramond",
              "fontJustification": ""
            },
            "headingsSimilarFonts": [
              "playfair display",
              "bitter",
              "playfair display"
            ],
            "headingsUsageGuide": "Use the heading font for all major titles and section headers to convey elegance and approachability. Pair with the paragraph font for body text to maintain readability and a cohesive organic feel. Maintain generous line spacing and avoid overly tight letter spacing to preserve clarity. Headings should contrast strongly with backgrounds using the 'primary' or 'darkBackground' colors for emphasis.",
            "headingsAccessibilityNotes": "Headings in 'primary' or 'darkBackground' colors on 'secondary' or 'lightBackground' backgrounds meet WCAG AA contrast standards, ensuring readability for users with visual impairments."
          },
          "paragraphs": {
            "font": {
              "role": "Main Body Text Font",
              "fontFamily": "open sans",
              "fontJustification": ""
            },
            "paragraphsSimilarFonts": [
              "nunito sans",
              "raleway",
              "work-sans-v2"
            ],
            "paragraphsUsageGuide": "Use the paragraph font for all body text, descriptions, and smaller informational text. It pairs well with the serif heading font to create a balanced typographic hierarchy. Maintain comfortable line height and letter spacing for readability. Text color should primarily be 'primary' or 'secondaryForeground' to ensure contrast against backgrounds.",
            "paragraphsAccessibilityNotes": "Paragraph text colors on their respective backgrounds meet WCAG AA contrast requirements, supporting accessibility and legibility."
          },
          "welcomeSectionTypography": {
            "placement": "Weighted Quadrant",
            "implementation": "The welcome section uses a two-column grid with text and image balanced side-by-side. Typography is placed in the left quadrant with ample padding and margin, creating a visual weight that anchors the design. The heading uses the serif font in a large size with the 'primary' color, while supporting text uses the sans-serif font in a smaller size and 'secondaryForeground' color. This placement creates a calm, inviting introduction that draws the eye naturally from text to image."
          },
          "fontSizes": [
            {
              "name": "xs",
              "size": "0.75rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "sm",
              "size": "0.875rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.02em",
              "fontWeight": "400"
            },
            {
              "name": "base",
              "size": "1rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "lg",
              "size": "1.125rem",
              "lineHeight": "1.5",
              "letterSpacing": "0.025em",
              "fontWeight": "400"
            },
            {
              "name": "xl",
              "size": "1.25rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "2xl",
              "size": "1.5rem",
              "lineHeight": "1.6",
              "letterSpacing": "0.03em",
              "fontWeight": "600"
            },
            {
              "name": "3xl",
              "size": "1.875rem",
              "lineHeight": "1.4",
              "letterSpacing": "0.03em",
              "fontWeight": "700"
            },
            {
              "name": "4xl",
              "size": "2.25rem",
              "lineHeight": "1.3",
              "letterSpacing": "0.035em",
              "fontWeight": "700"
            },
            {
              "name": "5xl",
              "size": "3rem",
              "lineHeight": "1.2",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "6xl",
              "size": "3.75rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.04em",
              "fontWeight": "700"
            },
            {
              "name": "7xl",
              "size": "4.5rem",
              "lineHeight": "1.1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "8xl",
              "size": "6rem",
              "lineHeight": "1",
              "letterSpacing": "0.05em",
              "fontWeight": "700"
            },
            {
              "name": "9xl",
              "size": "8rem",
              "lineHeight": "1",
              "letterSpacing": "0.06em",
              "fontWeight": "700"
            }
          ]
        },
        "layout": {
          "layoutDna": {
            "densitySpectrum": "Balanced",
            "contrastSpectrum": "Moderate Contrast",
            "gridAlignmentSpectrum": "Strict Grid",
            "negativeSpaceUsage": "Generous",
            "textVsImageEmphasis": "Balanced",
            "complexitySpectrum": "Simple & Clean"
          },
          "grid": {
            "compositionApproach": "Column-based",
            "spacing": {
              "columns": "12-column grid",
              "rows": "Defined content rows",
              "gaps": "Consistent medium gaps"
            },
            "margins": "Generous page margins",
            "padding": "Consistent padding within containers"
          }
        },
        "components": {
          "containers": "Containers have soft rounded corners and use the 'secondary' or 'darkBackground' colors for backgrounds. Padding is generous to create breathing room. Borders are minimal or absent, relying on color blocks to define sections.",
          "images": "Images are presented with rounded corners matching container radii, often paired side-by-side with text. They use natural lighting and warm tones, complementing the color palette. Some images have subtle overlays to enhance text readability.",
          "buttons": "Buttons use the 'accentYellow' color for filled backgrounds with 'primary' color text, or are outlined with 'primary' color and transparent backgrounds. Corners are rounded, and buttons have consistent padding and font styling to maintain a cohesive look."
        },
        "graphicElements": {
          "icons": "Icons are minimal and organic in style, using the 'primary' or 'accentYellow' colors. They complement the natural theme without overwhelming the design.",
          "illustrations": "No prominent illustrations are used; the design relies on photography and minimal graphic motifs such as leaf shapes in 'accentYellow' to reinforce the natural brand identity.",
          "stickers": "Stickers or badges use the 'accentYellow' background with 'primary' text, rounded corners, and simple shapes to highlight key messages or calls to action."
        }
      },
      "originImagesUrls": [
        "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1752422579245-Screenshot%202025-07-13%20at%2019.02.30.png"
      ]
    }
  ],
  "designerId": "45d286a9-c2d3-4558-807d-a3f26205dc86",
  "designerName": "Elise",
  "brandBook": {
    "tones": [
      "calm",
      "sophisticated",
      "minimal",
      "elegant",
      "modern",
      "refined",
      "timeless",
      "clean",
      "balanced",
      "understated"
    ],
    "designStyle": {
      "primaryStyle": [
        "Minimalism",
        "Modern"
      ],
      "supportingStyles": [
        "Editorial",
        "Luxury"
      ]
    },
    "toneOfVoice": "Sophisticated, minimalistic, elegant, and modern with a calm and refined personality.",
    "components": {
      "images": "Product images are presented with muted, neutral backgrounds in 'mutedGray' or similar tones, with rounded corners to soften the geometric layout. Images are large and clear, emphasizing product form and material without distraction.",
      "buttons": "Buttons are minimal with thin borders in 'primary' color and transparent backgrounds. Text inside buttons uses 'primary' color for clarity. On hover, buttons may invert colors or slightly darken the border to indicate interactivity while maintaining subtlety.",
      "containers": "Containers use generous padding and subtle borders in 'subtleBorder' color to define sections without heavy visual weight. Rounded corners soften container edges, maintaining the minimal and approachable feel. Backgrounds remain in 'background' color to preserve consistency."
    },
    "typography": {
      "headings": {
        "font": {
          "role": "Primary Heading Font",
          "fontFamily": "avenir-lt-w01_85-heavy1475544",
          "fontJustification": ""
        },
        "headingsUsageGuide": "Use the heading font in large sizes with tight letter spacing to create strong visual impact and hierarchy. Headings should be uppercase or all caps for a clean, modern look. Pair headings with the serif paragraph font to create contrast and balance. Maintain generous spacing around headings to preserve the minimal aesthetic. Use the 'primary' color for headings to ensure maximum readability and emphasis.",
        "headingsSimilarFonts": [
          "futura-lt-w01-book",
          "montserrat",
          "oswald"
        ],
        "headingsAccessibilityNotes": "Headings in 'primary' color on 'background' provide excellent contrast and meet WCAG AA standards for all sizes, ensuring clear readability and accessibility."
      },
      "fontSizes": [
        {
          "name": "xs",
          "size": "0.75rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.2",
          "fontWeight": "400"
        },
        {
          "name": "sm",
          "size": "0.875rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.3",
          "fontWeight": "400"
        },
        {
          "name": "base",
          "size": "1rem",
          "letterSpacing": "0.02em",
          "lineHeight": "1.5",
          "fontWeight": "400"
        },
        {
          "name": "lg",
          "size": "1.125rem",
          "letterSpacing": "0.01em",
          "lineHeight": "1.5",
          "fontWeight": "600"
        },
        {
          "name": "xl",
          "size": "1.5rem",
          "letterSpacing": "0em",
          "lineHeight": "1.4",
          "fontWeight": "700"
        },
        {
          "name": "2xl",
          "size": "2rem",
          "letterSpacing": "-0.01em",
          "lineHeight": "1.3",
          "fontWeight": "700"
        },
        {
          "name": "3xl",
          "size": "2.5rem",
          "letterSpacing": "-0.02em",
          "lineHeight": "1.2",
          "fontWeight": "800"
        },
        {
          "name": "4xl",
          "size": "3rem",
          "letterSpacing": "-0.03em",
          "lineHeight": "1.1",
          "fontWeight": "800"
        },
        {
          "name": "5xl",
          "size": "3.75rem",
          "letterSpacing": "-0.04em",
          "lineHeight": "1.1",
          "fontWeight": "900"
        },
        {
          "name": "6xl",
          "size": "4.5rem",
          "letterSpacing": "-0.05em",
          "lineHeight": "1.05",
          "fontWeight": "900"
        },
        {
          "name": "7xl",
          "size": "5.5rem",
          "letterSpacing": "-0.06em",
          "lineHeight": "1.05",
          "fontWeight": "900"
        },
        {
          "name": "8xl",
          "size": "6.5rem",
          "letterSpacing": "-0.07em",
          "lineHeight": "1",
          "fontWeight": "900"
        },
        {
          "name": "9xl",
          "size": "8rem",
          "letterSpacing": "-0.08em",
          "lineHeight": "1",
          "fontWeight": "900"
        }
      ],
      "paragraphs": {
        "font": {
          "role": "Main Body Text Font",
          "fontFamily": "baskervillemtw01-smbdit",
          "fontJustification": ""
        },
        "paragraphsUsageGuide": "Use the paragraph font in smaller sizes with italic styling to add a refined, editorial tone. This font contrasts with the bold sans-serif headings, creating a balanced typographic hierarchy. Use the 'secondary' color for body text and captions to soften the visual weight while maintaining readability. Maintain ample line height and spacing to enhance legibility and preserve the airy feel of the layout.",
        "paragraphsSimilarFonts": [
          "playfair display",
          "didot-w01-italic",
          "cormorantgaramond-light"
        ],
        "paragraphsAccessibilityNotes": "Paragraph text in 'secondary' color on 'background' meets WCAG AA contrast requirements for body text, ensuring accessible reading while supporting the elegant design."
      },
      "welcomeSectionTypography": {
        "placement": "Weighted Quadrant",
        "implementation": "The welcome section uses a two-column layout with large, bold headings occupying the left quadrant and a product image with rounded corners on the right quadrant. This placement balances visual weight between text and imagery, creating a harmonious and inviting introduction. The heading's large size and tight letter spacing draw immediate attention, while the image's soft edges and neutral background complement the typography. The generous white space around both elements enhances clarity and focus, reinforcing the minimal and elegant brand identity."
      }
    },
    "originImagesUrls": [
      "https://wixmp-fe53c9ff592a4da924211f23.wixmp.com/uploads/1750580630382-Screenshot%202025-06-22%20at%2011.23.45.png"
    ],
    "layout": {
      "grid": {
        "margins": "Generous page margins",
        "padding": "Consistent padding within containers",
        "spacing": {
          "gaps": "Consistent medium gaps",
          "rows": "Defined content rows",
          "columns": "12-column grid"
        },
        "compositionApproach": "Modular"
      },
      "layoutDna": {
        "contrastSpectrum": "High-Contrast",
        "densitySpectrum": "Spacious",
        "textVsImageEmphasis": "Balanced",
        "complexitySpectrum": "Simple & Clean",
        "gridAlignmentSpectrum": "Strict Grid",
        "negativeSpaceUsage": "Generous"
      }
    },
    "graphicElements": {
      "icons": "Icons are line-based, minimal, and use the 'primary' color to maintain consistency with text and UI elements. They are simple and unobtrusive, supporting navigation and interaction without drawing excessive attention.",
      "stickers": "Stickers or badges, such as sale indicators, use subtle outlines in 'primary' color with italic serif text to blend with the editorial tone without disrupting the minimal aesthetic.",
      "illustrations": "No illustrations are used, keeping the focus on product photography and typography to maintain a clean and sophisticated look."
    },
    "designSummary": "This design features a minimalistic and refined aesthetic with a spacious, balanced layout. The color palette is dominated by a soft, warm off-white background paired with black and dark gray text for high contrast and readability. Typography plays a central role, combining large, bold, geometric sans-serif headings with delicate italic serif body text to create a sophisticated editorial tone. The layout uses generous white space and a modular grid with consistent margins and subtle rounded corners on images and cards, adding a modern yet approachable softness. UI elements are understated with thin borders and minimal fills, emphasizing clarity and elegance. Overall, the design conveys a timeless, high-end brand identity suitable for luxury products, focusing on simplicity, clarity, and subtle sophistication.",
    "palette": {
      "colors": {
        "background": "#F7F5F0",
        "secondary": "#4A4A4A",
        "customColors": [
          {
            "name": "subtleborder",
            "value": "#D1CDC7"
          },
          {
            "name": "mutedgray",
            "value": "#B0B0B0"
          },
          {
            "name": "foreground",
            "value": "#4A4A4A"
          }
        ],
        "secondaryForeground": "#F7F5F0",
        "primaryForeground": "#F7F5F0",
        "primary": "#000000"
      },
      "paletteUsageGuide": "Use the 'background' color as the primary canvas to create a soft, warm environment that supports content without distraction. The 'primary' color is reserved for main text and headings to ensure maximum readability and strong visual hierarchy. The 'secondary' color is used for less prominent text and UI elements, providing subtle contrast without overpowering the primary text. The 'subtleBorder' color is ideal for delicate dividing lines and borders around interactive elements, maintaining the minimal aesthetic. The 'mutedGray' color can be used for secondary UI elements or placeholder text to add depth without breaking the calm tone. All colors should be combined to maintain high contrast and accessibility, with 'primary' text on 'background' for main content and 'secondary' for supporting text. Avoid using heavy fills or saturated colors to preserve the understated luxury feel.",
      "paletteAccessibilityNotes": "The 'primary' color on 'background' provides excellent contrast exceeding WCAG AA standards for all text sizes. The 'secondary' color on 'background' also meets WCAG AA contrast requirements for body text and UI elements. Borders and subtle UI accents using 'subtleBorder' and 'mutedGray' maintain sufficient contrast for visibility without overwhelming the design. Overall, the palette supports accessible reading and interaction while preserving the minimal and elegant aesthetic."
    }
  },
  "initialPrompt": "Build a modern, conversion-focused marketing website for LetsGrowPro, a growth marketing & performance agency. The site should include a sticky navigation bar, hero section, partner logos, services, case studies, process, testimonials, pricing, FAQ, final CTA band, and contact/footer. Use the specified brand colors, typography, and layout details provided. Ensure accessibility, performance optimization, and responsive design.",
  "status": "READY",
  "revision": "11",
  "createdDate": "2025-10-26T23:32:10.184Z",
  "updatedDate": "2025-10-26T23:32:27.079Z",
  "attachments": {
    "contentImagesUrls": [],
    "inspirationImagesUrls": []
  },
  "selectedBrandingPresetId": "9fcae758-95a7-4545-9fbd-b80749c06532",
  "plan": "{\n  \"sections\": [\n    {\n      \"id\": \"overview\",\n      \"title\": \"## Overview\",\n      \"content\": \"This app will create a modern marketing website for LetsGrowPro, focusing on conversion and user engagement.\"\n    },\n    {\n      \"id\": \"key-features\",\n      \"title\": \"## Key features\",\n      \"content\": \"- **Homepage**: Users can view the hero section, partner logos, and final CTA band.\\n- **Services**: Users can explore the various services offered by the agency.\\n- **Case Studies**: Users can read about successful projects and their outcomes.\\n- **Testimonials**: Users can see feedback from clients.\\n- **Pricing**: Users can view pricing options for services.\\n- **FAQ**: Users can find answers to common questions.\\n- **Contact**: Users can reach out through a contact form.\"\n    },\n    {\n      \"id\": \"structure\",\n      \"title\": \"## Structure\",\n      \"content\": \"- **Homepage**: Users can view the hero section, partner logos, and final CTA band.\\n- **Services**: Users can explore the various services offered by the agency.\\n- **Case Studies**: Users can read about successful projects and their outcomes.\\n- **Testimonials**: Users can see feedback from clients.\\n- **Pricing**: Users can view pricing options for services.\\n- **FAQ**: Users can find answers to common questions.\\n- **Contact**: Users can reach out through a contact form.\"\n    }\n  ],\n  \"apps\": [\n    {\n      \"id\": \"wix-cms\",\n      \"keyFeatures\": [\n        { \"id\": \"homepage-slug\", \"name\": \"Homepage\" },\n        { \"id\": \"services-slug\", \"name\": \"Services\" },\n        { \"id\": \"case-studies-slug\", \"name\": \"Case Studies\" },\n        { \"id\": \"testimonials-slug\", \"name\": \"Testimonials\" },\n        { \"id\": \"pricing-slug\", \"name\": \"Pricing\" },\n        { \"id\": \"faq-slug\", \"name\": \"FAQ\" },\n        { \"id\": \"contact-slug\", \"name\": \"Contact\" }\n      ]\n    }\n  ],\n  \"version\": \"2.2\"\n}",
  "designerData": {
    "designerId": "45d286a9-c2d3-4558-807d-a3f26205dc86",
    "designerName": "Elise",
    "selectionMethod": "UNSELECTED"
  }
}